app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "zwUxCTiEq9ILsjm5CXvFXg"], ["updated_at", "2020-08-17 20:07:07.859529"], ["id", 41]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save